Autodesk.Revit.RelatedFileUtils.CreateRelatedFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ModelPath,System.Boolean)
Creates a file related to an existing file.
source:
The path of the existing file.
target:
The path of the related file to create.
overwrite:
True means silently overwrite if a file already exists at the target.
False means fail.
Returns:
Whether creation succeeded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL